---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.NominalDiameter
source: html/a776a666-b35e-d053-797e-578dfc1dd9c1.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.NominalDiameter Property

The nominal diameter of the pipe. Units: (ft).

## Syntax (C#)
```csharp
public double NominalDiameter { get; }
```